Tekla.Structures.Drawing.LevelMark.LevelMarkType
Defines options about how the level mark is shown.

Tekla.Structures.Drawing.LevelMark.LevelMarkType.NoArrowNoLeaderLine
Level mark is shown without an arrow and a leader line.

Tekla.Structures.Drawing.LevelMark.LevelMarkType.ArrowWithoutLeaderLine
Level mark is shown with an arrow but without a leader line.

Tekla.Structures.Drawing.LevelMark.LevelMarkType.InclinedLeaderLine
Level mark is shown with an inclined leader line but without an arrow.

Tekla.Structures.Drawing.LevelMark.LevelMarkType.OrthogonalLeaderLine
Level mark is shown with an orthogonal leader line and with an arrow.